In [1]:
import numpy as np
import pandas as pd

In [3]:
ndic = {'Korea':{2019:4.6, 2020:5.7, 2021:4.8},
        'Japan':{2020:1.5, 2020:1.5, 2021:1.6}}

df1 = pd.DataFrame(ndic).T
df1

       2019  2020  2021
Korea   4.6   5.7   4.8
Japan   NaN   1.5   1.6

In [6]:
data2 = [['Choi', 29], ['Kim', 32], ['Jung', 27], ['Lee', 25]]
df2 = pd.DataFrame(data2, columns = ['Name', 'Age'], index = [1, 2, 3, 4])

df2.iloc[2]['Age']

27

In [7]:
data3 = {'Team':['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank':[1, 2, 2, 3,  3, 4, 1,  1, 2, 3, 1,  2],
         'Year':[2014, 2015, 2014, 2015, 2014, 2015, 2016, 2017, 2016, 2014, 2015, 2017],
         'Points':[876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690]}

df3 = pd.DataFrame(data3)
df3.groupby('Team')['Points'].mean()

Team
Devils    768.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
kings     812.000000
Name: Points, dtype: float64

In [33]:
data4 = [['Choi', 29], ['Kim', 32], ['Jung', 27], ['Lee', 25]]
df4 = pd.DataFrame(data4, columns = ['Name', 'Age'], index = [1, 2, 3, 4])
df4

   Name  Age
1  Choi   29
2   Kim   32
3  Jung   27
4   Lee   25

In [34]:
df44 = df4[['Name']]
df44

   Name
1  Choi
2   Kim
3  Jung
4   Lee

In [35]:
del df4['Age']
df4

   Name
1  Choi
2   Kim
3  Jung
4   Lee

In [14]:
df4

   Name
1  Choi
2   Kim
3  Jung
4   Lee

In [17]:
df5 = pd.DataFrame(data=[['Seol', 'A', 'B', None],
                         ['Kim', 'B+', None, None],
                         ['Choi', 'B+', None, 'A'],
                         ['Jung', 'A', None, 'A+']],
                   columns = ['Family Name', 'Python', 'DS', 'Algorithm'])
df5 = df5.set_index('Family Name').T
df5

Family Name  Seol   Kim  Choi  Jung
Python          A    B+    B+     A
DS              B  None  None  None
Algorithm    None  None     A    A+

In [38]:
df5.isna().sum(axis=1)

Python       0
DS           3
Algorithm    2
dtype: int64

In [24]:
df6 = pd.DataFrame(np.arange(1, 17).reshape(4, 4))
df6

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [27]:
(df6 + df6.mean(axis=1)) **2

        0       1       2       3
0   12.25   72.25  182.25  342.25
1   56.25  156.25  306.25  506.25
2  132.25  272.25  462.25  702.25
3  240.25  420.25  650.25  930.25

In [28]:
df7 = pd.DataFrame(np.arange(25).reshape(5, 5), columns = list('abcde'))
df77 = pd.DataFrame(np.arange(16).reshape(4, 4), columns = list('abcd'))
(df7 + df77).fillna(0)

      a     b     c     d    e
0   0.0   2.0   4.0   6.0  0.0
1   9.0  11.0  13.0  15.0  0.0
2  18.0  20.0  22.0  24.0  0.0
3  27.0  29.0  31.0  33.0  0.0
4   0.0   0.0   0.0   0.0  0.0

In [29]:
df8 = pd.DataFrame(np.arange(16).reshape(4, 4))
df88 = pd.DataFrame([[1, 0, 0, 0],
                     [0, 1, 0, 0],
                     [0, 0, 1, 0],
                     [0, 0, 0, 1]])
df8.dot(df88)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15